Revit 2027 API
ExternalCommandData Class
 A class contains reference to Application and View which are needed by external command.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.UI.ExternalCommandData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalCommandData : APIObject
Public Class ExternalCommandData
	Inherits APIObject
public ref class ExternalCommandData : public APIObject
type ExternalCommandData =
    class
        inherit APIObject
    end
The ExternalCommandData type exposes the following members.
Properties
Name | Description
Application |  Retrieves an object that represents the current Application for external command.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
JournalData | A data map that can be used to read and write data to the Autodesk Revit journal file.
View |  Retrieves an object that represents the View external command work on.
Top
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.UI Namespace